{"data":{"site":{"siteMetadata":{"title":"Craig Neeson","author":"Craig Neeson"}},"markdownRemark":{"id":"88768d1a-612c-5ac8-b33c-1fed319fe7cb","excerpt":"Notes collected and tidied up a bit from my trip to ReactAmsterdam2019.Contents07.30 - Registration08.00 - Welcome Breakfast09.00 - Conference Opening09.2…","html":"<p>Notes collected and tidied up a bit from my trip to <a href=\"https://react.amsterdam/\">ReactAmsterdam2019</a>.</p>\n<hr>\n<h2>Contents</h2>\n<p><strong>07.30</strong> - <a href=\"#id-registration\">Registration</a><br>\n<strong>08.00</strong> - <a href=\"#id-welcome-breakfast\">Welcome Breakfast</a><br>\n<strong>09.00</strong> - <a href=\"#id-conference-opening\">Conference Opening</a><br>\n<strong>09.20</strong> - <a href=\"#id-requisite-react\">Requisite React - Kent C. Dodds </a><br>\n<strong>09.50</strong> - <a href=\"#id-refactoring-react\">Refactoring React - Siddharth Kshetrapal</a><br>\n<strong>10.20</strong> - <a href=\"#id-coffee-break-1\">Coffee Break</a><br>\n<strong>10.50</strong> - <a href=\"#id-common-design-language\">A Common Design Language - Andrey Okonetchnikov</a><br>\n<strong>11.20</strong> - <a href=\"#id-designing-with-react\">Designing with React - Mark Dalgleish</a><br>\n<strong>11.50</strong> - <a href=\"#id-lightning-talks\">Lightning Talks</a><br>\n<strong>12.20</strong> - <a href=\"#id-lunch-break\">Lunch Break</a><br>\n<strong>13.20</strong> - <a href=\"#id-oss\">GitNation Open Source Stage</a><br>\n<strong>13.50</strong> - <a href=\"#id-tech-regrets-at-spectrum\">Tech Regrets at Spectrum - Max Stoiber</a><br>\n<strong>14.20</strong> - <a href=\"#id-microfrontends\">Scaling Applications with Microfrontends - Max Gallo</a><br>\n<strong>14.50</strong> - <a href=\"#id-svg\">An SVGs Tale - Elizabet Oliveira</a><br>\n<strong>15.20</strong> - <a href=\"#id-coffee-break-2\">Coffee Break</a><br>\n<strong>15.50</strong> - <a href=\"#id-oss-awards\">React Open Source Awards</a><br>\n<strong>16.10</strong> - <a href=\"#id-graphql-dev-experience\">The GraphQL Developer Experience - Peggy Rayzis</a><br>\n<strong>16.35</strong> - <a href=\"#id-one-on-one\">One-on-one Session - Andrey Okonetchnikov</a><br>\n<strong>16.40</strong> - <a href=\"#id-webgl\">Painting Pixels with WebGL and React Hooks - Ashi Krishnan</a><br>\n<strong>17.10</strong> - <a href=\"#id-closing\">Talks section closing and announcements</a>  </p>\n<hr>\n<h2>Notes</h2>\n<div id='id-registration'/>\n<h3>07.30 - Registration</h3>\n<div id='id-welcome-breakfast'/>\n<h3>08.00 - Welcome Breakfast</h3>\n<div id='id-conference-opening'/>\n<h3>09.00 - Conference Opening</h3>\n<div id='id-requisite-react'/>\n<h3>09.20 - <strong>Requisite React</strong> - <a href=\"https://github.com/kentcdodds\">Kent C. Dodds</a></h3>\n<p>High Level talk with an emphasis on people who want to up their React skills. To do so effectively, we need to take things back to basics and try to understand the abstractions that we use every day at a lower level.</p>\n<ul>\n<li>We use abstractions everyday, most of which we never give a second thought.</li>\n<li>We need to weigh up the benefits vs. the costs of abstractions.</li>\n<li>If we stop to consider and even try to understand what is going on underneath the abstractions, <strong>it will allow us to use them more effectively</strong>.</li>\n<li>Basic example included JSX compiling down to base Javascript, once we understand how the individual parts of JSX are passed into the <code class=\"language-text\">createElement</code> function, it makes debugging your code alot more straightforward.</li>\n<li>Chats about how React will determine what kind of component to render based on the casing of your JSX. In the case of lowercase components, a standard HTML element will be rendered (‘called a composite component’) and in the case of capitalised ones, React will render a ‘custom component’. </li>\n<li>Another good example was how string interpolation typically happens, understanding this a bit better will probably help us to understand a few of the errors we come up against with <code class=\"language-text\">styled-components</code> from time-to-time, as the whole package is based on the mechanics of tagged template literals.</li>\n<li>The final example used is understanding the newer hooks APIs. One common pitfall is that the order that hooks are initialised matters, and getting them in the wrong order can cause bugs. Understanding what happens underneath the API can help us with debugging some of this. </li>\n<li>Final takeaway: if we want to level up our React skills, try to build something that you use at an abstracted layer, try to build lodash or a hooks implementation.</li>\n</ul>\n<div id='id-refactoring-react'/>\n<h3>09.50 - <strong>Refactoring React</strong> - <a href=\"https://github.com/siddharthkp\">Siddharth Kshetrapal</a></h3>\n<p>Sidd is an independent dev who mostly works on tooling for frontend devs. Talk was very useful, went through what looked to be a normal class component and pointed out a few code smells and how we might fix them. Primary takeaway is the list of code smells mentioned.</p>\n<p><strong>Code Smells:</strong></p>\n<ul>\n<li>Using props inside the constructor is usually a code smell. This is because the constructor code only runs once. In the example, Sidd showed a case where we map one of the props to state inside the constructor function. The issue with it only running once is that the mapping will only happen at most once, which almost always leads to unexpected bugs.</li>\n<li><strong>Feature Envy</strong> - occurs when a parent or container component becomes too interested in the functionality of its children. Showed example where container had a form component inside it, rough pseudo is below. The primary problem: the container wants to hand off control of the form submit function to its parent, but instead of just passing the props straight to the child, we have an intermediate function which runs some stuff before we call the props function. This is a fairly innocent example but it can be easy for the contents of <code class=\"language-text\">handleSubmit</code> to grow to a point where its actions might confuse the parent who is passing in the props. Do not mix controlled and uncontrolled components, it can only be one or the other.</li>\n</ul>\n<div class=\"gatsby-highlight\" data-language=\"jsx\"><pre class=\"language-jsx\"><code class=\"language-jsx\"><span class=\"token operator\">...</span>\n<span class=\"token function\">handleSubmit</span><span class=\"token punctuation\">(</span><span class=\"token parameter\">event</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span>\n    event<span class=\"token punctuation\">.</span><span class=\"token function\">preventDefault</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n    <span class=\"token keyword\">this</span><span class=\"token punctuation\">.</span>props<span class=\"token punctuation\">.</span><span class=\"token function\">handleSubmit</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n<span class=\"token punctuation\">}</span>\n\n<span class=\"token function\">render</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span>\n\n    <span class=\"token keyword\">return</span> <span class=\"token punctuation\">(</span>\n        <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span><span class=\"token class-name\">TheForm</span></span> <span class=\"token attr-name\">onSubmit</span><span class=\"token script language-javascript\"><span class=\"token script-punctuation punctuation\">=</span><span class=\"token punctuation\">{</span><span class=\"token keyword\">this</span><span class=\"token punctuation\">.</span>handleSubmit<span class=\"token punctuation\">}</span></span><span class=\"token punctuation\">></span></span><span class=\"token plain-text\">\n            ...\n        &lt;/ TheForm>\n    );\n}\n...</span></code></pre></div>\n<ul>\n<li>Be wary of spreading props like the below example shows. Depending on where the spread is, it can have unintended effects. At the bottom it will act as a default, at the top, any props called <code class=\"language-text\">someProp</code> or <code class=\"language-text\">someOtherProp</code> will always be overriden. which can be unexpected.</li>\n</ul>\n<div class=\"gatsby-highlight\" data-language=\"jsx\"><pre class=\"language-jsx\"><code class=\"language-jsx\"><span class=\"token function\">render</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span>\n    <span class=\"token keyword\">return</span> <span class=\"token punctuation\">(</span>\n        <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span><span class=\"token class-name\">SomeComponent</span></span>\n            <span class=\"token spread\"><span class=\"token punctuation\">{</span><span class=\"token punctuation\">...</span><span class=\"token attr-value\">this</span><span class=\"token punctuation\">.</span><span class=\"token attr-value\">props</span><span class=\"token punctuation\">}</span></span>\n            <span class=\"token attr-name\">someProp</span>\n            <span class=\"token attr-name\">someOtherProp</span>\n        <span class=\"token punctuation\">/></span></span>\n    <span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n<span class=\"token punctuation\">}</span></code></pre></div>\n<ul>\n<li><strong>Single responsibility principal</strong> - good to ask yourself from time to time when looking at components. It states that a component should do only one thing and do it well.</li>\n<li>Prefer hooks over higher order components in 2019. The reason for this is that people generally chain HOCs together, each extra HOC call in the chain will modify props, making it difficult to determine inputs and outputs reliably for debugging and testing. We can develop custom hooks which can provide the same traits and behaviours that a component might need from a HOC, many hooks can be injected into a component and can be tested individually.</li>\n<li>Had a great example as below where you might need to pass props to all children, we have run into this requirement already with the CL. First urge would be to use a HOC which will use <code class=\"language-text\">React.clone</code> to map the props onto all children, generally speaking, anytime you see <code class=\"language-text\">React.clone</code>, it is usually a code smell. Instead prefer the use of the context API, the HOC parent will become the provider, and all of the children will become consumers, which is much, much cleaner. <strong>He uses a hook to inject the context</strong>.</li>\n</ul>\n<div class=\"gatsby-highlight\" data-language=\"jsx\"><pre class=\"language-jsx\"><code class=\"language-jsx\"><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span><span class=\"token class-name\">ParentCom</span></span><span class=\"token punctuation\">></span></span><span class=\"token plain-text\">\n    </span><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span><span class=\"token class-name\">SubCom1</span></span> <span class=\"token punctuation\">/></span></span><span class=\"token plain-text\">\n    </span><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span><span class=\"token class-name\">SubCom2</span></span> <span class=\"token punctuation\">/></span></span><span class=\"token plain-text\">\n    </span><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span><span class=\"token class-name\">SubCom3</span></span> <span class=\"token punctuation\">/></span></span><span class=\"token plain-text\">\n</span><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span><span class=\"token class-name\">ParentCom</span></span><span class=\"token punctuation\">></span></span></code></pre></div>\n<div id='id-coffee-break-1'/>\n<h3>10.20 - Coffee Break</h3>\n<div id='id-common-design-language'/>\n<h3>10.50 - <strong>A Common Design Language. Let Designers and Devs talk to eachother</strong> - <a href=\"https://github.com/okonet\">Andrey Okonetchnikov</a></h3>\n<p>Andrey is a freelance dev from Austria who has a deep understanding of design and component systems. Primary takeaway are his interesting thoughts on breaking components down so that they are composed of many primitive components, which then share a commonality with the same primitives that UX folks are used to when creating designs.</p>\n<ul>\n<li>Talks about the topic of languages and communication techniques in general.</li>\n<li>Typography, colors and spacing are the language of the design system.</li>\n<li>It is difficult translating designs from designers into actual implentable things. Talked of a common language between the design and developer worlds</li>\n<li>Andreys answer would be to break web components down into their base primitives, as it is these primitives (rects, circles, polygons), that designers use to do mock ups.</li>\n<li>Interesting choice on a few of the components were the use of a prop called <code class=\"language-text\">kind</code> to represent a different kind of button, would be closest to our <code class=\"language-text\">variant</code> prop, might consider switching if it makes more semantic sense to consumers.</li>\n<li>Talked about comparison of constrained components vs. base HTML elements, the main takeaway is that HTML is a nightmare to actually constrain, which is crappy if we are trying to create a design system.</li>\n<li>Interesting project to check out is <a href=\"https://github.com/ant-design/antd-sketchapp\">ant-sketchapp</a>, Ant seem to have got an interesting implementation of the sketchapp tool.</li>\n<li><a href=\"https://component-driven.io/\">component-driven.io</a> is a site hosting his newsletter, based off the info in the talk, would be good to keep up to date with Andreys findings.</li>\n</ul>\n<div id='id-designing-with-react'/>\n<h3>11.20 - <strong>Designing with React</strong> - <a href=\"https://github.com/markdalgleish\">Mark Dalgleish</a></h3>\n<p>Awesome talk from Mark Dalgleish who works for <a href=\"https://www.seek.com.au/\">Seek software</a> in Australia. Primary takeaway was the Playroom project and the thought that we as devs should be creating component libraries that are so straightforward that designers should be able to use them to prototype things too.</p>\n<ul>\n<li>Design systems are all about bridging the divide between design and development.</li>\n<li>Makes sense for designers to design in the final medium (React).</li>\n<li>Components essentially let us build our own domain specific language, everyone should know what a <code class=\"language-text\">Button</code> looks and behaves like. And so we can better understand how it might be used in combination with other components.</li>\n<li>Mentions <a href=\"https://github.com/brainly/html-sketchapp\">html-sketchapp</a> again and the fact that it is more flexible than <a href=\"https://github.com/airbnb/react-sketchapp\">react-sketchapp</a>. Showed off a hidden route on their CL site that renders out all components to one page, the output of this page (just a JSON file) can then be feed to <code class=\"language-text\">html-sketchapp</code> and all of the domain specific names for things will be properly converted to sketch assets and symbols.</li>\n<li>\n<p>There is alot of swell in this area of research at the minute. Actual products that have been created for the purpose of unifying dev and design are:</p>\n<ul>\n<li><a href=\"https://www.framer.com/\">Framer-X</a></li>\n<li><a href=\"http://www.modulestudio.co.uk/\">Module Studio</a></li>\n<li><a href=\"https://interplayapp.com/\">Interplay</a> (which is the one being adopted at Seek, mostly because it is web-based)</li>\n</ul>\n</li>\n<li>It is important that consumers (devs and designers) understand how a tool works. Examples of this are the babel and typescript repls, which aim to demystify what goes on in both of their transpilers by showing compiled and uncompiled code side-by-side in realtime, Playroom essentially does the same thing except with code, and with a visual viewport.</li>\n<li>Interestingly none of the Seek components actually contain spacing props, they are positioned via parent components such as <code class=\"language-text\">Section</code> which handles whitespace. This allows for components to remain unpolluted with positioning props.</li>\n<li>Seek does not use variant names like <code class=\"language-text\">primary</code> and <code class=\"language-text\">secondary</code> to denote differences, they use the actual brand colour names instead. They also use boolean values to denote differences in components, for example <code class=\"language-text\">&lt;Text hero&gt;&lt;Text&gt;</code> which denotes a piece of text that should be emphasised as the header of a page.</li>\n<li><strong>We need to add a share button back into our playroom implementation,</strong> this will be key if we want designers to actually start using it to mock things up, we don’t currently have access to the iFrame’s URL, which contains a base64 encoded string so that the current mock up can be shared.</li>\n<li><strong>We need to add a link to the raw playroom instance so that users can have a bit more space in the editor.</strong></li>\n<li>We can also pass multiple themes into the config which is something we haven’t needed to explore yet.</li>\n<li>Seek is currently building a new design system called <a href=\"https://github.com/seek-oss/braid-design-system\">Braid</a>.</li>\n<li>Idea of Braid is that it has many themes. Seek, like Flexera is comprised of many smaller companies, each with their own brand to uphold. Braid will allow for all devs in the different companies to use the exact same components (the same design language) and behaviours, but the look and feel will be different, this sounds like an awesome idea.</li>\n<li>Pull Request workflow has a bunch of integrated tests, the most notable being one that throws up a test instance of the doc site for us to eyeball before it actually goes into SIT/Production.</li>\n<li>Playroom will hopefully become the first place that people go to mock up new designs for Flexera’s products.</li>\n<li><strong>We need a page in the CL that better explains the role of Playroom and the fact that it is not just an interesting toy</strong></li>\n</ul>\n<div id='id-lightning-talks'/>\n<h3>11.50 - Lightning Talks</h3>\n<p>Not alot of notes taken as all the presentations were about SSR.</p>\n<ul>\n<li><strong>Mark from <a href=\"https://www.nearform.com/\">Nearform</a></strong> - talks about how Nearform have developed new methods to speed up the algorithms with which Server Side Rendering is accomplished. Interestingly the key to many of the speed ups was the use of tagged template literals.</li>\n</ul>\n<div id='id-lunch-break'/>\n<h3>12.20 - Lunch Break</h3>\n<div id='id-oss'/>\n<h3>13.20 - GitNation Open Source Stage</h3>\n<p><a href=\"https://gitnation.org/\">GitNation</a> present a few awards to developers who have brought exciting new open source software to the market every year. The actual awards were later in the day, but GitNation allowed a few devs who were onsite to pitch their ideas. Presentations:</p>\n<ul>\n<li>\n<p><strong><a href=\"https://github.com/ghengeveld/react-async\">React Async</a></strong></p>\n<ul>\n<li>A new way to manage promise lifecycles in React.</li>\n<li>Has a few higher order components such as a wrapper called <code class=\"language-text\">&lt;async&gt;</code> which will have a sub-component called <code class=\"language-text\">&lt;async.fulfilled&gt;</code>, the fulfilled bit will wrap a bit of JSX that should be rendered once the promise has resolved successfully.</li>\n<li>Provides a hook that behaves in the same way.</li>\n<li>Was created to bridge the gap between what we have now to manage promises, and the upcoming suspense API. </li>\n</ul>\n</li>\n<li>\n<p><strong><a href=\"https://github.com/wilk/microjob\">MicroJob</a></strong></p>\n<ul>\n<li>Aims to bring multithreading to React.</li>\n<li>Talks a bit around using the relatively new concept of web workers to split CPU cycles off onto its own thread for some operations.</li>\n<li>Might be good if we are doing heavy data manipulation on the client side, but this seems like a bit of an anti-pattern to begin with, unclear what the use-case might be, perhaps in more multimedia-style system this would be really useful.</li>\n</ul>\n</li>\n<li>\n<p><strong><a href=\"https://github.com/FormidableLabs/urql\">URQL</a></strong></p>\n<ul>\n<li>A better way to do graphQL queries from React, made by Formidable Labs. </li>\n<li>Sort of like a competitor to Apollo.</li>\n<li>The more I see how async calls can be done with hooks, the more I realise that we need to adopt the approach going forward.</li>\n</ul>\n</li>\n<li>\n<p><strong><a href=\"https://github.com/pomber/git-history\">GitHistory</a></strong></p>\n<ul>\n<li>Seen this popup on reddit about 6 months ago, is a service that can be used to nicely present the differences between GitHub files. Sort of like blame but alot nicer.</li>\n<li>Tryed to bring home the importance of intuitive tooling, and how we achieve the exact same thing (minus the pretty animations) with a few flags on <code class=\"language-text\">git log</code>. Theorises that most people never read the full <code class=\"language-text\">git</code> manual and so getting more complex results out of the tool is something that never happens for most users.</li>\n</ul>\n</li>\n</ul>\n<div id='id-tech-regrets-at-spectrum'/>\n<h3>13.50 - <strong>Tech Regrets at Spectrum</strong> - <a href=\"https://github.com/mxstbr\">Max Stoiber</a></h3>\n<p>High level talk that dives into a few of the technical decisions made at Max’s latest company - <a href=\"https://github.com/mxstb\">Spectrum</a>. One of the best talks of the day describing the pitfalls of making bad decisions and not proofing things out before going to implementation.</p>\n<ul>\n<li>Spectrum was bought by GitHub recently.</li>\n<li>Reflects on the tech choices that were made at Spectrum with a focus on the bad ones.</li>\n<li>Many of the mistakes were made while designing out out the backend, the primary reason being that all three devs on the team were much more geared toward frontend work.</li>\n<li>\n<p><strong>Regret 1:</strong> not using <a href=\"https://github.com/necolas/react-native-web\">react-native-web</a></p>\n<ul>\n<li>If he were to do it all again, he would use react-native-web, this would allow him to write components in react-native, which will allow for the code to obviously work on native devices, but the package will allow for the same code to be converted for use on the web.</li>\n<li>In lieu of such a conversion mechanism, they ended up writing native applications for each platform, which took alot longer.</li>\n<li>Would have made alot more sense to go mobile-first, they originally went browser-first with the thinking that they could retrofit a few media queries to support mobile.</li>\n<li><strong>Lesson 1:</strong> building a good product is all about experimentation and momentum. Optimise your processes for iteration speed and flexibility.</li>\n</ul>\n</li>\n<li>\n<p><strong>Regret 2:</strong> not using <a href=\"https://nextjs.org\">nextjs</a></p>\n<ul>\n<li>All chats had to be search indexed, this is the primary way that users should be brought to the site.</li>\n<li>SSR is a must for search engine indexing, what they found was that their pages were indexed without issue but mostly before the actual chat content had fully come down from a async call. This pretty much resulted in blank screens with a loader being indexed, and not the content itself.</li>\n<li>Instead of using something like nextjs, they tried to build their own bespoke SSR service which was a terrible idea by the sounds of it.</li>\n<li><strong>Lesson 2:</strong> ues existing solutions to technology problems where possible, particularly ones that you do not understand deeply.</li>\n</ul>\n</li>\n<li>\n<p><strong>Regret 3:</strong> using <a href=\"https://www.rethinkdb.com\">RethinkDB</a></p>\n<ul>\n<li>The app of course had to be realtime, it was a chat app, without it being realtime, its behaviour and feature-set was closer to a forum.</li>\n<li>It was logical at the time to go with a realtime database.</li>\n<li>The most attractive feature of rethink was a concept called ‘change feeds’, which would allow for a listener to be added to a database query. This, in theory would allow for listeners to update clients when a chat log received a new update.</li>\n<li>A problem was that Rethink has not been adopted by many large companies, and as a result the community and subsequent support was non-existent.</li>\n<li>They had more outages related to database problems than anything else.</li>\n<li>Due to the lack of community knowledge, debugging anything was very difficult, it was hard to know where to even start with a problem.</li>\n<li>They did not find an implementation where they could get change feeds to scale out of the box. In the time it took them to get change feeds working in a desirable manner, they could have just written a bit of pub/sub middleware for the server that would have produced the same behaviours.</li>\n<li><strong>Lessson 3:</strong> carefully choose core technologies based on how difficult they are to change later.</li>\n<li><strong>Lessoon 4:</strong> prioritise community size and active maintenence when choosing technologies, especially when in unfamiliar territory.</li>\n</ul>\n</li>\n<li>\n<p><strong>Regret 4:</strong> using <a href=\"https://draftjs.org\">DraftJS</a> and WYSIWYG Editing</p>\n<ul>\n<li>Tried to build their own editor for use in comments and posts, this turned out to be obsenely difficult and their first release was very buggy because of it.</li>\n<li>In the end they ripped out their first implementation and replaced it with a lightweight markdown editor.</li>\n<li><strong>Lesson 5:</strong> Deliberately assess cutting edge tech, bias towards conservative choices. Will be the last time Max uses something new and shiny without proofing it out first.</li>\n<li><strong>Lesson 6:</strong> Be open with your roadmap to learn about your users priorities. Had Max have asked his users what they wanted before implementing, it would have been a little more obvious that they, as developers, would prefer a markdown editing experience anyway as that is what they are used to.</li>\n</ul>\n</li>\n</ul>\n<div id='id-microfrontends'/>\n<h3>14.20 - <strong>Scaling Applications with Microfrontends</strong> - <a href=\"https://github.com/maxgallo\">Max Gallo</a></h3>\n<p>Works for a high profile entertainment streaming company called <a href=\"https://www.dazn.com/\">DAZN</a>. Talk focuses on performance, scalability, and getting UI teams to a state where they can make decisions by themselves, without affecting other areas of the overall frontend product.</p>\n<ul>\n<li>There was a time when building a digital product consisted of just a single database, a monolithic backend and a SPA-style frontend. </li>\n<li>The first evolution was to enable the backends to be scalable - enter the load balancer and instance duplication.</li>\n<li>The second evolution was the scale up the databases now that they had become the bottleneck, distributed databases were implemented at this point.</li>\n<li>Even after all of that evolution on the backend and database areas of the stack - the frontend remains the same.</li>\n<li>We still come up against the same issues nowadays that we always have when multiple teams work on the same codebase. There is a communication overhead for implementations because all decisions need to be checked off by all teams that work on the app. This is converse the backend stacks, where micro-services allow for teams and their areas of concern to be truely isolated, where they are free to make tech choices as they see fit.</li>\n<li>Describes a model similar to this but for the frontend (a Microfrontend). The split would occur across business domains, one team owns one business domain, and so they make updates in that one section only.</li>\n<li>Spotify implemented something a bit like this. They’re original targets were the native platforms, they used a series of event buses written in C++ which would return iFrames full of content depending on what was requested, these were called spotlets. This meant that one team would be responsible for one spotlet, and the spotlets would be orchestrated together via the event bus layer. This particular model would allow for multiple spotlets to be present on one page, it is unclear how inter-spotlet communication and overall state management works.</li>\n<li>At DAZN they took a different approach. Each microfrontend is represented by a single page, and one team is responsible for that page and that page alone. When any page is requested from their site, a tiny <code class=\"language-text\">bootstrapper.js</code> file is returned, this behaves a little like our <code class=\"language-text\">scoutfiles</code> do. The only thing it will render out is a spinner, the rest is just orchestration; the bootstrapper will lift the requested route and make an API call to get that individual page from whereever it is hosted. It also sets of intercepts the current context (login status, saved state). All of this complexity is raised up out of the microfrontend and is shared.</li>\n<li>Interestingly Max was against the idea of component libraries, each team implements indivudally. The primary argument against them is again the communication overhead, having a share library would require teams to make agreements about things, which slows the process down. This way, teams can ship code whenever they want, if it is at different rates - that is OK. He said it is common for different pages to have different version numbers, which perfectly illustrates how they are managed by entirely separate teams.</li>\n<li>Interesting views in terms of serving separate frontends and keeping things highly modular, would be interesting to know how they orchestrate UX changes between teams, how that is even remotely kept in sync if they do not share common components.</li>\n</ul>\n<div id='id-svg'/>\n<h3>14.50 - <strong>An SVGs Tale</strong> - <a href=\"https://github.com/miukimiu\">Elizabet Oliveira</a></h3>\n<p>Design-focused talk, Elizabet chats about how SVG and React integrates really well with eachother if you plan things out well.</p>\n<ul>\n<li>Primary examples of how SVGs have won out in the war for graphics implementations on the web is the ability to style them using CSS and Javascript. Like other alternatives, their file size never changes, which makes them highly suitable for the web.</li>\n<li>Preference for using SVGs in an inline fashion, this is the only way to keep them flexible and stylable.</li>\n<li>Best way that Elizabet had found was to import them from a separate file and wrap them up as React components. This approach would allow for you to keep all of the benefits of the inline SVG, but not have to look at the massive code footprint that would be in your JSX. </li>\n<li>Demoed a tape player component, which was made up of many smaller wrapped SVGs. The interesting part was that she could pass in props to each of the sub-components, which in turn would be mapped onto the style of the individual SVGs, seems like a really flexible and manageable way to build large graphics up.</li>\n</ul>\n<div id='id-coffee-break-2'/>\n<h3>15.20 - Coffee Break</h3>\n<div id='id-oss-awardsg'/>\n<h3>15.50 - React Open Source Awards</h3>\n<p>Awards ceremony for the best open source project this year, there were alot of tools and packages that I had never heard of in this list so it would definitely be worth doing a bit of research on each to see if there is anything we could use. The most obvious one is <code class=\"language-text\">react-navigation</code>, would be interesting to see what this one is all about.</p>\n<ul>\n<li>\n<p>Breakthrough of the year</p>\n<ul>\n<li><a href=\"https://github.com/callstack/linaria\">Linaria</a></li>\n<li><a href=\"https://github.com/jaredpalmer/formik\">Formik</a></li>\n<li><a href=\"https://github.com/mweststrate/immer\">Immer</a> (won)</li>\n<li><a href=\"https://reactnavigation.org/\">React-Navigation</a></li>\n</ul>\n</li>\n<li>\n<p>Most exciting us of tech</p>\n<ul>\n<li><a href=\"https://github.com/rstacruz/remount\">Remount</a></li>\n<li><a href=\"https://github.com/pomber/code-surfer\">Code surfer</a></li>\n<li><a href=\"https://github.com/hshoff/vx\">VX</a> (won)</li>\n<li><a href=\"https://github.com/diegohaz/constate\">Constate</a></li>\n</ul>\n</li>\n<li>\n<p>Fun side project of the year</p>\n<ul>\n<li><a href=\"https://github.com/React95/React95\">React95</a> (won)</li>\n<li><a href=\"https://github.com/mohitk05/react-insta-stories\">React-insta-stories</a></li>\n</ul>\n</li>\n<li>\n<p>Most impactful contribute to the community</p>\n<ul>\n<li><a href=\"https://github.com/kentcdodds/react-testing-library\">React-testing-library</a> (won) champions accessibility</li>\n<li><a href=\"https://github.com/wix/Detox\">Detox</a></li>\n<li><a href=\"https://reactnavigation.org/\">React-Navigation</a></li>\n<li><a href=\"https://github.com/downshift-js/downshift\">Downshift</a></li>\n</ul>\n</li>\n<li>\n<p>Productivity booster</p>\n<ul>\n<li><a href=\"https://github.com/jaredpalmer/formik\">Formik</a></li>\n<li><a href=\"https://github.com/react-cosmos/react-cosmos\">React-cosmos</a></li>\n<li><a href=\"https://github.com/jxnblk/mdx-deck\">Mdx-deck</a> (won)</li>\n<li><a href=\"https://github.com/tannerlinsley/react-table\">React-table</a></li>\n</ul>\n</li>\n</ul>\n<div id='id-graphql-dev-experience'/>\n<h3>16.10 - <strong>The GraphQL Developer Experience</strong> - Peggy Rayzis (missed)</h3>\n<div id='id-one-on-one'/>\n<h3>16.35 - <strong>One-on-one Session</strong> Andrey Okonetchnikov</h3>\n<p>Since the final few talks of the day weren’t 100% relevant to what I am doing right now, I was lucky enough to get booked in with Andrey Okonetchnikov for a one-on-one session. The primary focus here was getting some critical feedback on our current iterations of the component library, Andrey is an expert in design systems and so his feedback was excellent and very useful.</p>\n<ul>\n<li>Impressed with how we are preferring to write composable sub-components for things like the header, really lends itself to a key characteristic of what a CL should be - flexible, but constrained.</li>\n<li>Asked opinions on using brand colours vs. practical names for situations like below. He suggested striking a compromise between the two and to have a mapping layer between the colour palette file (which would contain the names of the colours familiar to everyone in the org, including designers), and the practical names which denote what the colours mean in the context of the application.</li>\n</ul>\n<div class=\"gatsby-highlight\" data-language=\"jsx\"><pre class=\"language-jsx\"><code class=\"language-jsx\">    <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span><span class=\"token class-name\">Button</span></span> <span class=\"token attr-name\">variant</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>primary<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span><span class=\"token plain-text\">Test</span><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span><span class=\"token class-name\">Button</span></span><span class=\"token punctuation\">></span></span>\n    <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span><span class=\"token class-name\">Button</span></span> <span class=\"token attr-name\">variant</span><span class=\"token attr-value\"><span class=\"token punctuation\">=</span><span class=\"token punctuation\">\"</span>flexeraBlue<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span><span class=\"token plain-text\">Test</span><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span><span class=\"token class-name\">Button</span></span><span class=\"token punctuation\">></span></span></code></pre></div>\n<ul>\n<li>He agreed strongly that we should implement some kind of primitive component(s) that are responsible soley for positioning purposes. The idea here is that our actual components should not contain any spacing metadata at all, allowing them to be completely standalone. Most usefully, he demoed one of his own implementations, these primitives were called <code class=\"language-text\">box</code>, <code class=\"language-text\">flex</code> and <code class=\"language-text\">stack</code>, each exhibiting slightly different behaviours. <code class=\"language-text\">stack</code> was the only one we had time to demo, he passed 4 or 5 components into a stack and adjusted a prop, each nested component now had a bit of spacing around it. After seeing it in action, this is definitely something that we will want to do before the CL reaches its first consumers. The library that he was demoing was called <a href=\"https://github.com/rebassjs/grid\">grid</a> which is published under the rebass organisation (the same folks that put together styled-system).</li>\n<li>Was a fan of the react app we are using for the component library but would steer us strongly towards using something third party. I mentioned that we had used storybook in the past and although it had some good plugins, it was difficult to brand and to add good, structured documentation to. An alternative that he suggested was <code class=\"language-text\">styleguidist</code>, a project he had worked closely on. After demoing a few features, this seems like something that we really want to proof out, it had excellent plugin support for inline editing, code snippets, markdown can be used for documentation, and he showed off a plugin that generates a props table from static typescript (which is something that I literally was not smart enough to figure out a few months ago.) Overall this seems like it would be a good move, but it does need proofed out, a secondary concern is style parity with the design-kit repo, it was not 100% clear how much control and flexibility we get around styling of the overall site. If the CL usability is highly improved due to moving to styleguidist, it might be worth the potential style disparity. </li>\n<li>Another good point he made about one of the other speakers was the use of booleans as props that signify visual things. He is not a fan of this approach due to the fact that combinations can leave a component in an odd state. For example <code class=\"language-text\">&lt;Text type=&quot;secondary&quot; isHero&gt;My Title&lt;/Text&gt;</code>, it would be strange to have a bit of typography with a <code class=\"language-text\">secondary</code> type to also look like a hero. Sticking to enumerated lists solves this problem.</li>\n</ul>\n<div id='id-webgl'/>\n<h3>16.40 - <strong>Painting Pixels with WebGL and React Hooks</strong> - Ashi Krishnan (missed)</h3>\n<div id='id-closing'/>\n<h3>17.10 - Talks section closing and announcements</h3>\n<p>The conference has run every year since 2016, if you want to find out more, check out their <a href=\"https://react.amsterdam/\">website</a>.</p>","frontmatter":{"title":"ReactAmsterdam 2019 Conference Notes","date":"April 12, 2019","timeToRead":"5 minute","isNote":true}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/react-amsterdam-notes/","previous":null,"next":{"fields":{"slug":"/write-your-own-tools-when-it-makes-sense/"},"frontmatter":{"title":"Write your own tools when it makes sense to","timeToRead":"3 minute","isNote":false,"isPublished":false}}}}